Revit 2027 API
FabricationService.IsPaletteExcluded Method
 Get whether a service palette is excluded from being used by the Route and Fill, Design to Fabrication, or Multi Point Routing commands. The default configuration values may be overridden by SetServicePaletteExclusions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsPaletteExcluded(
	int paletteIndex
)
Public Function IsPaletteExcluded (
	paletteIndex As Integer
) As Boolean
public:
bool IsPaletteExcluded(
	int paletteIndex
)
member IsPaletteExcluded :
        paletteIndex : int -> bool
Parameters
paletteIndex Int32
 The index of the palete.
Return Value
Boolean
 Returns true if the palette indexed by paletteIndex is currently to be excluded.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index paletteIndex is not larger or equal to 0 and less than PaletteCount.
See Also
Reference
FabricationService Class
Autodesk.Revit.DB Namespace